app/controllers/tasks_controller.rb

  def index
    @tasks = Task.all # Assuming you have a Task model and want to fetch all tasks
---
SELECT "tasks".* FROM "tasks"